# -*- coding:utf-8 -*-
"""
go-cqhttp的客户端
                           ```::`  `
                            ':.   `:``.
                         .''::!!!::'`''`.
                    .';!!!!!!!;;!!!%|;;;::`
                  :!!!!;;!!!;:;!!|%%%|!;:'`':`
                :!!!;':!!|%%|!!!!;;!!|!;!||!;!;.
              .;!!;;!!!|%%|||||%%|||!|||!::;!!;!:
             `;!!!!!!!%!:;|!!||!;;!!!!!||!;;;;;;!:
            '!!!||;;!||!;;;!;:;:'';;'::!|!;;;;;;;|;
           '!!!!!;;!|!;;;;;;!!;;;;;;;!;!|!!!;;;;;!|:
          '!;;!;;;!|!;;;;;;!!;;;;;;;;;;||!!!!;;;;;!!`
         `!;;|%$&$%!;;;;;;!!;;;;;;;;;;;!!|!||;;;;;!!'
        `;;;!;::;!|!;;;;;;||;;;;!!;;!!;;;!;|%!;;;!||;.
       .;!:;!;:;!||!;!;;;!!;;;;;!!!;!!!::!;||!!;;!|!;`
       :!:;!!!|$$||!!!!;;;;;;;;;!!;;;!;`';!;!||!;!|!:'.
      ';'';!!;;!|||!!||!!:';;;;!!!;::;` '!:';%%|;!|;.`'
     .'.`;!!!;;|%|!;';!::`.'::::':``:` .:'..;%$%!!|;.`'.
     `. ';!!!;;|%!!|$@$$@$:`''``` .'!&&$$@&|!|%%|||!` :`
       .:!!!!;!%|!:` '%$%!` ..      .!$%%;``''';||!!` ':
       `!!!!|!!|;;:` .';;`.          `'''` ':'':||!;. `:.
  ``   :|!!!|!||:':'.                     `'``';!%!'. .:`
  '.  .;!!!!|||%%;``.                    .```;!!!!;'.  ``
 `'   .;;:;!|%%||%%|:.                   `;|%|;!;:;'.  ``
 .`   `;:`:!!||!;!!|%|'                 :$$%|!!:.'!:.  ..
  ..  .;: ';!|:';:'.`|$$%:          .;%$$$$%|!!: :|:   ..
       `' .:;!'.`:;''!%%|;:;;:'``'':::!%%|;:!' .';;.  .`
       ..  `;;'. `:. `;:':;:'`.....`:;::'.';`   :;`  .`
            '::.  .`''''':'..........``.'::'`..
            .':::'''''....``........`.  ..```''''
           `::;' . ...     .''``.  .`.     ...``. ..
アトリは、高性能ですから!
"""
import websocket


class CqHttpClient(websocket.WebSocketApp):
    """go-cqhttp的Websocket客户端"""
    def __init__(self, react_group_id: int, ip: str, port: int, token: str, debug: bool = False):
        # Websocket基本设置
        self.ws_address = ip
        self.ws_port = port
        self.access_token = token
        self.react_group_id = react_group_id
        self.client_to_query_stats = '1'
        self.client_to_query_online = '2'
        # Websocket-Client DEBUG设置
        websocket.enableTrace(debug)

        # Websocket链接设置
        url = 'ws://{}:{}/'.format(self.ws_address, self.ws_port)
        if self.access_token != '':
            url += '?access_token={}'.format(self.access_token)

        # 连接至Websocket服务器
        print('[INFO]Connecting to {}'.format(url))
        super().__init__(url, on_message=self.on_message)

